Repository: infomed/infowordpress
Catalog: translations/infowordpress.*.po
Languages: es

source: Infopost
es: Entrada

source: Inforecents
es: Recientes

source: Infoblog
es: Blogs

source: Infocategories
es: Infocategorías

source: Title
es: Título

source: Type
es: Tipo

source: Region
es: Región

source: Operations
es: Operaciones

source: edit
es: editar

source: delete
es: eliminar

source: configure
es: configurar

source: No infowordpress blocks exist.
es: No existen bloques de Blogs (wordpress).

source: Enter the title of the block
es: Introduzca el título del bloque

source: Set Blog, Filter options and Refresh.
es: Asignar Blog, opciones de filtro y Refrescar.

source: Url of Wordpress Mu
es: Url del Blog (Wordpress Mu)

source: Select the Url of Wordpress Mu.
es: Seleccione la Url del Blog (Wordpress Mu).

source: Blog Name
es: Nombre del Blog

source: The name of blog at Wordpress Mu. Leave blank if is the root blog.
es: Nombre del Blog (en Wordpress Mu). Déjelo en blanco para el blog raíz.

source: WARNING! If you change it, you have to Refresh Posts.
es: ATENCION! Si cambia el nombre del blog, tiene que Refrescar Entradas.

source: Category
es: Categoría

source: The name of category to filter posts.
es: Nombre de la Categoría por la que desea filtrar las entradas.

source: Author
es: Autor

source: The author of posts, to filter by him.
es: Autor por el que desea filtrar las entradas.

source: Date
es: Fecha

source: You can filter by year or month-year or day-month. Leave blank the part of the date for which doesn't want to filter
es: Puede filtrar por año o mes-año o día-mes. Deje en blanco las partes de la fecha por las que no desea filtrar.

source: Refresh Posts
es: Refrescar Entradas

source: Select a Post
es: Seleccione una Entrada

source: Select the Title of Post that you want to show.
es: Seleccione el título de la Entrada que desea mostrar en el bloque.

source: Sorry, there are no Posts at this Blog name, with those filter options.
es: Disculpe, en el Blog no hay entradas con esas opciones de filtro.

source: View in block
es: Ver resultados

source: Display
es: Mostrar

source: Whole post
es: Entrada completa

source: Teaser
es: Resumen

source: What part of post you want to show in the block.
es: Qué parte de la Entrada desea mostrar en el bloque.

source: Display also
es: Mostrar además

source: Categories
es: Categorías

source: Attachments
es: Adjuntos

source: Description
es: Descripción

source: Enter the description of the block
es: Introduzca la descripción del bloque

source: Show Description
es: Mostrar Descripción

source: Up of the Items
es: Arriba de la lista

source: Below of the Items
es: Debajo de la lista

source: Select the place where you want to show Description.
es: Seleccione el lugar donde va a mostrar la Descripción.

source: Filter by:
es: Filtrar por:

source: Max Posts
es: Cantidad de Entradas

source: The maximum number of %content that will appear in the block.
es: La mayor cantidad de %content a mostrar en el bloque.

source: posts
es: entradas

source: Display Posts
es: Mostrar Entradas

source: Results Page
es: Página de resultados

source: Items List, with more... link
es: Lista de items, con el enlace más...

source: Items List
es: Lista de Items

source: Content List
es: Lista de Contenido

source: How to show posts in the block.
es: Cómo mostrar las Entradas en el bloque.

source: Items link
es: Enlaces en los items

source: To Post
es: Al contenido de la Entrada

source: To first Attachment
es: Al primer Adjunto de la Entrada

source: Select To Post if you want to get full post when you click an item. Select To first Attachment if you want to get the first post Attachment when you click an item.
es: Seleccione Al contenido de la Entrada si desea mostrar la entrada completa cuando se da click en el elemento de la list. Seleccione Al primer adjunto de la Entrada si desea obtener el adjunto.

source: Max Blogs
es: Cantidad de Blogs

source: Number of post for each blog
es: Mostrar entradas de cada blog

source: Yes
es: Sí

source: Select if you want to display the number of posts for each blog or not.
es: Seleccione si desea mostrar la cantidad de entradas de cada blog o no.

source: Users by Role
es: Usuarios por Rol

source: None of them
es: Ninguno

source: Administrator
es: Administrador

source: Contributor
es: Contribuyente

source: Subscriber
es: Subscriptor

source: Select if you want to display blog users or not.
es: Seleccione si desea mostrar los usuarios del blog o no.

source: Refresh Categories
es: Refrescar Categorías

source: Select Categories
es: Seleccionar Categorías

source: Select the Categories that you want to show in block.
es: Seleccione las Categorías que desea mostrar en el bloque.

source: List of Posts associated to the Category:
es: Lista de Entradas asociadas a la Categoría:

source: Each Post have link
es: El vínculo en las entradas es

source: Sorry, there are no Categories at this Blog name.
es: Disculpe, no existen Categorías en el blog seleccionado.

source: none
es: ninguno

source: Assign a block to a region.
es: Asigne el bloque a una región.

source: Submit
es: Guardar

source: Sorry, that is not a valid URL.
es: Disculpe, esta no es una URL válida.

source: Sorry, this block requieres login and password at settings.
es: Disculpe, para este bloque tiene que llenar usuario y contraseña en las opciones del módulo.

source: You have to select a post.
es: Debe seleccionar una entrada.

source: You must insert a number of Post Id.
es: Usted debe seleccionar una Entrada.

source: You must insert a number for the maximum number of posts.
es: Usted debe insertar una cantidad de Entradas.

source: Post Id must be positive.
es: El identificador de la Entrada debe ser positivo.

source: Maximum number of posts must be positive.
es: El Máximo número de Entradas debe ser positivo.

source: Are you sure you want to delete %title?
es: ¿Está seguro de que quiere eliminar %title?

source: This action cannot be undone.
es: Esta acción no se puede deshacer.

source: Delete
es: Eliminar

source: Cancel
es: Cancelar

source: The block has been removed.
es: El bloque ha sido eliminado.

source: Wordpress Url
es: Url del Blog (Wordpress)

source: No Urls exist.
es: No existen Urls.

source: Encrypt Passwords
es: Encriptar Contraseñas

source: To encrypt passwords you have to enable extension:php_mcrypt.dll, at php.ini. Be sure that Php installation have libmcrypt.dll
es: Para encriptar las contraseñas hay que habilitar la extensión:php_mcrypt.dll, en php.ini. La instalación de Php debe incluir libmcrypt.dll.

source: The fully-qualified URL of the Wordpress Mu server( Endpoint). Ej. http://blogs.sld.cu/
es: Url válida de Blogs (Wordpress Mu). Ej. http://blogs.sld.cu/

source: Username
es: Nombre de usuario

source: Enter the username at that Wordpress Mu, if you want the InfoBlogs block.
es: Introduzca el nombre de usuario si desea crear un bloque de Lista de Blogs.

source: Enter the password that accompanies your username in both fields.
es: Introduzca la contraseña que acompaña al nombre de usuario en los dos campos.

source: There was an error. Check the Url
es: Hubo un error. Chequee la Url.

source: Sorry, that URL already exists at settings.
es: Disculpe, esta URL existe en las opciones.

source: Select if you want to encrypt or not, paswords that you enter to connect with Wordpress Web Service.
es: Seleccione si desea (o no) encriptar las contraseñas para conectarse al Blog (Wordpress Mu).

source: Key
es: Clave

source: Enter the key to encrypt passwords.
es: Introduzca la clave para encriptar las contraseñas.

source: You have to enter a key.
es: La clave es obligatoria.

source: The following blocks are using this setting. They will be deleted, and <em>all data from them will be lost</em>!
es: Los bloques siguientes están usando esta opción. Ellos serán eliminados y sus datos se perderán.

source: Confirm deletion
es: Confirmar eliminación

source: Are you sure you want to delete %url and blocks above?. <p>This action cannot be undone.</p>
es: ¿Está seguro de que quiere eliminar %url y los bloques de arriba?. <p>Esta acción no puede revertirse.</p>

source: Are you sure you want to delete %url?
es: ¿Está seguro de que quiere eliminar %url?

source: <strong>Description:</strong> It allows to visualize inside Drupal posts and blogs of Wordpress Mu. For example: <a href="http://blogs.sld.cu/">Blogs Service of Infomed</a>. It integrates with the Web Service XMLRPC of Wordpress. Requieres <a href="http://wpmudev.org/project/infomed-xml-rpc-methods">infoxmlrpc</a> plugin for Wp Mu.
es: <strong>Descripción:</strong> Permite ver dentro de Drupal entradas de Wordpress Mu. Por ejemplo: <a href="http://blogs.sld.cu/">Servicio de Blogs de Infomed</a>. Se integra con el Web Service XMLRPC del Wordpress. Requiere el plugin <a href="http://wpmudev.org/project/infomed-xml-rpc-methods">infoxmlrpc</a> para WpMu.

source: <strong>Installation:</strong> Copy the module to the folder of modules of your installation of Drupal (..\sites\all\modules\). Enable it in administer->modules. When module is enabled, it creates administration menu and tables with prefix infowordpress_
es: <strong>Instalación:</strong> Copie el módulo a la carpeta de módulos de su instalación de Drupal (..\sites\all\modules\). Habilítelo en administrar->construcción del sitio->módulos. Al habilitar el módulo este crea el menú de administración y tablas con el prefijo wordpress_.

source: <strong>Administration Menu:</strong><ul><li>Administer Infowordpress (shows module help)<ul><li>Permissions<ul><li>View Infowordpress Posts: allows to see posts.</li><li>Administer Infowordpress: allows the access to the administration menu.</li><li>Administer Infowordpress Blocks: allows the access to the Blocks option.</li><li>Configure Infowordpress: allows the access to the Settings option.</li></ul></li><li>Settings<ul><li>Wordpress Url: Allows configuration of one or more instances of Wordpress, based on the URL, username and password for connecting to Web Service.</li><li>Encrypt Passwords: to configure if wordpress passwords will encrypted before save them in drupal table.</li></ul></li><li>Blocks<ul><li>InfoPost: to display a Wordpress post, based on the URL of Wordpress Mu, the name of Blog and the post.</li><li>InfoRecents: to display a list of the most recent entries on a Blog, based on Url of Wordpress Mu, the Blog name and the maximum number of posts to be displayed on the block.</li><li>InfoBlogs: to display a list of blogs and their administrators at a Wp Mu instance, based on Url of Wordpress Mu and the maximum number of blogs to be displayed on the block. It requires xmlrpc_info.php web service (created by Infomed), at Wp Mu instance!</li></ul></li></ul></li></ul>
es: <strong>Menú de Administración:</strong><ul><li>Administrar Blogs (muestra la ayuda)<ul><li>Permisos<ul><li>Ver entradas: permite ver las entradas recuperadas con los bloques.</li><li>Administrar Blogs: permite el acceso al menú de administración.</li><li>Administrar Bloques de Blogs: permite el acceso a la opción Bloques.</li><li>Configurar Blogs: permite el acceso a la opción de Configuración.</li></ul></li><li>Opciones<ul><li>Blogs Url: para configurar una o más instancias de Blogs (Wordpress Mu), basado en la URL, nombre de usuario y contraseña para conectarse al Web Service.</li><li>Encriptar Passwords: para configurar si las contraseñas de blogs se encriptarán antes de guardarlas en drupal.</li></ul></li><li>Bloques<ul><li>Una Entrada: para mostrar una entrada de blogs, basado en la URL de Blogs (Wordpress Mu), el nombre del blog y la entrada.</li><li>Lista Recientes: para mostrar una lista de entradas más recientes de un Blog, basado en la URL de Blogs (Wordpress Mu), el nombre del blog y la mayor cantidad de entradas a mostrar en el bloque.</li><li>Lista Blogs: para mostrar la lista de blogs y sus usuarios, de una instancia de Wp Mu, basado en el Url de la instancia de Blogs (Wordpress Mu) y el máximo de blogs a mostrar en el bloque. Requiere del Web Service xmlrpc_info.php (creado por Infomed), en la instancia de Wp Mu!</ul></li></ul></li></ul>

source: <strong>Tables:</strong> <ul><li>infowordpress_block: to save blocks of module</li></ul>
es: <strong>Tablas:</strong> <ul><li>wordpress_block: para guardar los bloques del módulo</li></ul>

source: <strong>Visualization:</strong> Like any other block of Drupal, an Infowordpress block should be placed in any region to display, this can be done in: administer->site building->blocks. <ul><li>InfoPost block: <ul><li>Its title</li></ul> <ul><li>The creation date</li></ul> <ul><li>The author</li></ul> <ul><li>The description (and link to see more) or the full text</li></ul> <ul><li>Categories</li></ul></li> <li>InfoRecents block: Displays a list of recents posts titles or a list of recents posts full text.</li></ul>
es: <strong>Visualización:</strong> Como cualquier otro bloque de Drupal, un bloque de Blogs (Wordpress) debe ser ubicado en alguna región para mostrarse, esto se puede hacer en: administrar->construcción del sitio->bloques. <ul><li>Bloque Una Entrada: <ul><li>Título</li></ul> <ul><li>Fecha de creación</li></ul> <ul><li>Autor</li></ul> <ul><li>Descripción (enlace para ver más) o texto completo de la entrada</li></ul> <ul><li>Categorías</li></ul></li> <li>Bloque Lista Recientes: Muestra una lista de las entradas más recientes por sus títulos o las entradas completas según se haya configurado.</li></ul>

source: If the Web Service gives error or not recover any data the block is not visualized.
es: Si el Web Service da un error o no se recuperan datos el bloque no se muestra.

source: <strong>Disable:</strong> Disable in: administer->modules. After would stop to be shown: <ul><li>The Administer Infowordpress Menu</li></ul> <ul><li>The blocks that had been located in any region</li></ul> But still stay the tables created by the module with all its data.
es: <strong>Deshabilitar:</strong> Deshabilitar en: administrar->módulos. Después de lo cual no se mostrarán: <ul><li>El Menú de Administración</li></ul> <ul><li>Los bloques que fueron ubicados en cualquier región</li></ul> Pero se mantienen las tablas creadas por el módulo y todos sus datos.

source: <strong>Uninstall:</strong> Uninstall in: administer->modules->uninstall. After would eliminate the tables created by the module and in the table blocks (Drupal) deletes records whose from is Infowordpress.
es: <strong>Desinstalar:</strong> Desinstalar en: administrar->módulos>desinstalar. Después de lo cual se eliminan las tablas creadas por el módulo y los registros en la tabla bloques de Drupal cuyo módulo es Blogs.

source: block
es: bloque

source: Updated '%module' block: '%title'.
es: Actualizado '%module' bloque: '%title'.

source: Added '%module' block: '%title'.
es: Adicionado '%module' bloque: '%title'.

source: Deleted '%module' block: '%title'.
es: Eliminado '%module' block: '%title'.

source: Sorry, this wordpress service is not available now. Try later. Url:
es: Disculpe, este servicio de blogs no está disponible ahora. Trate luego. Url:

source: Edit block
es: Editar bloque

source: Infowordpress Error
es: Error del Blog

source: on block
es: en el bloque

source: Allows view posts and blogs from Wordpress Mu. Provides integration with wordpress's XMLRPC web services. Requieres infoxmlrpc plugin (http://wpmudev.org/project/infomed-xml-rpc-methods) for Wp Mu.
es: Permite ver Entradas de Wordpress Mu. Proporciona la integración con el web service XMLRPC del Wordpress. Requiere el plugin Infoxmlrpc (http://wpmudev.org/project/infomed-xml-rpc-methods) para WpMu

source: Posts for the Category:
es: Entradas de la Categoría:

source: InfoWordpress block does not exist (iwpid:%iwpid)
es: El bloque del Blog no existe (iwpid:%iwpid)

source: Archive for the Category:
es: Entradas de la Categoría:

source: more...
es: más...

source: Read more
es: Leer más

source: Read the rest of post
es: Leer el resto de la Entrada

source: Categories:
es: Categorías:

source: posts
es: entradas

source: Administrators:
es: Administradores:

source: Editors:
es: Editores:

source: Authors:
es: Autores:

source: Contributors:
es: Contribuyentes:

source: Subscribers:
es: Subscriptores:

source: Identifier for infowordpress block.
es: Indentificador de un bloque de infowordpress

source: Block title.
es: Titulo del bloque

source: Block description.
es: Descripción del bloque.

source: Defines the place to show description: 1: Up of the Items, 2: Below of the Items.
es: Define el lugar donde mostrar la descripción, 1: Ariba de la lista, 2: Debajo de la lista.

source: Identifier of wordpress MU instance.
es: Identificador de la instancia de Wordpress MU

source: Name of Blog.
es: Nombre del blog.

source: To filter posts by category.
es: Para filtrar las entradas por categoria.

source: To filter posts by author.
es: Para filtrar las entradas por autor.

source: To filter posts by date.
es: Para filtrar las entradas por fecha.

source: Defines if item link is to post content (0) or to post attachment (1).
es: Define si el vinculo es al contenido de la entrada(0) o a su primer adjunto(1).

source: Block type: 1 a post, 2 list of recents posts, 3 list of blogs, 4 categories.
es: Tipo del bloque: 1 entrada, 2 lista de recientes, 3 lista de blogs, 4 categorias de un blog.

source: Identifier of post to show or maximun number of items in list.
es: Identificador de una entrada o la mayor cantidad de elementos en el bloque.

source: How to show results in blocks.
es: Como mostrar los resultados en el bloque.

source: To show other information like: post's autor, category, date.
es: Mostrar el autor, las categorias o la fecha de la entrada.

source: Category identifier.
es: Identificador de la categoria.

source: Category name.
es: Nombre de la categoria.

source: If category was selected to show in block or not: 1: Show, 0: Dont show.
es: Identifica si la categoría se muestra(1) o no(0) en el bloque.

source: Infowordpress
es: Blogs

source: view infowordpress posts
es: ver entradas de blogs

source: administer infowordpress
es: administrar blogs

source: administer infowordpress blocks
es: administrar bloques de blogs

source: configure infowordpress encrypt
es: configurar encriptación

source: configure infowordpress
es: configurar blogs

source: Administer Infowordpress
es: Administrar Blogs

source: Permissions
es: Permisos

source: Blocks
es: Bloques/Cajas

source: list
es: listado

source: add infopost
es: agregar entrada

source: edit infopost block
es: editar bloque entrada

source: add inforecents
es: agregar recientes

source: edit inforecents block
es: editar bloque recientes

source: add infoblogs
es: agregar blogs

source: edit infoblogs block
es: editar bloque blogs

source: add infocategories
es: agregar categorías

source: edit infocategories block
es: editar bloque categorías

source: delete infowordpress block
es: eliminar bloque blogs

source: Settings
es: Configuración

source: view infowordpress settings
es: ver opción de blogs

source: add infowordpress setting
es: agregar opción de blogs

source: edit infowordpress setting
es: editar opción de blogs

source: edit encrypt setting
es: editar opción encriptar

source: delete infowordpress setting
es: eliminar opción de blogs
